# BendingDetailTypeSegmentLengthsForArcsDisplayOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeSegmentLengthsForArcsDisplayOption Property
ParameterTypeId Class See Also
---
"Arc Segment Lengths"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeSegmentLengthsForArcsDisplayOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthsForArcsDisplayOption As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthsForArcsDisplayOption {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace